# Homebrew Bundle file for mzsh
# Manage taps, formulae, and casks here.

# Taps
# Support multiple .NET SDK versions installed side-by-side
# See: https://github.com/isen-ng/homebrew-dotnet-sdk-versions
tap "isen-ng/dotnet-sdk-versions"

# Formulae
brew "git"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "bat"
brew "eza"
brew "yazi"
brew "atuin"
brew "z"
brew "git-delta"
brew "htop"
brew "btop"
brew "pstree"
brew "jq"
brew "ffmpeg"
brew "sevenzip"
brew "poppler"
brew "fd"
brew "ripgrep"
brew "zoxide"
brew "resvg"
brew "imagemagick"
brew "gping"
brew "bun"
brew "antigen"

# Casks
# Meta-packages for .NET SDKs; install multiple versions as needed
cask "dotnet-sdk8"
cask "dotnet-sdk9"
