# Homebrew Bundle file for mzsh
# Manage taps, formulae, and casks here.

# Taps
# Support multiple .NET SDK versions installed side-by-side
# See: https://github.com/isen-ng/homebrew-dotnet-sdk-versions
tap "isen-ng/dotnet-sdk-versions"

# Bun (official tap for compatibility across Homebrew versions)
tap "oven-sh/bun"

# Formulae
brew "git"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "antigen"
brew "fzf"
brew "bat"
brew "eza"
brew "yazi"
brew "atuin"
brew "z"
brew "git-delta"
brew "htop"
brew "btop"
brew "pstree"
brew "jq"
brew "ffmpeg"
brew "sevenzip"
brew "poppler"
brew "fd"
brew "ripgrep"
brew "zoxide"
brew "resvg"
brew "imagemagick"
brew "gping"
brew "gawk"
brew "oven-sh/bun/bun"
brew "magic-wormhole"
brew "docker"
brew "docker-compose"
brew "colima"
brew "node"

# Casks
# Meta-packages for .NET SDKs; install multiple versions as needed
cask "dotnet-sdk8"
cask "dotnet-sdk9"

# Communication apps
cask "slack"
cask "discord"
cask "warp"

# Utility apps
cask "trex"                               # OCR tool - extract text from screenshots
cask "linearmouse"                        # customize mouse behavior - disable acceleration

# Quick Look plugins
cask "qlvideo"
cask "quicklook-json"
cask "syntax-highlight"          # syntax highlighting for source code and text files
cask "webpquicklook"
cask "suspicious-package"
cask "quicklook-csv"
